#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/webstorm/pa-tsa-conference-app-api/runs/run-sFq2Eznx3fT7PdBX

Waiting for the plan to start...

Terraform v1.4.2
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_cosmosdb_account.pa_tsa_conference_cosmosdb will be created
  + resource "azurerm_cosmosdb_account" "pa_tsa_conference_cosmosdb" {
      + access_key_metadata_writes_enabled    = true
      + analytical_storage_enabled            = false
      + connection_strings                    = (sensitive value)
      + create_mode                           = (known after apply)
      + default_identity_type                 = "FirstPartyIdentity"
      + enable_automatic_failover             = false
      + enable_free_tier                      = false
      + enable_multiple_write_locations       = false
      + endpoint                              = (known after apply)
      + id                                    = (known after apply)
      + is_virtual_network_filter_enabled     = false
      + kind                                  = "MongoDB"
      + local_authentication_disabled         = false
      + location                              = "eastus"
      + mongo_server_version                  = (known after apply)
      + name                                  = "pa-tsa-conference-cosmos"
      + network_acl_bypass_for_azure_services = false
      + offer_type                            = "Standard"
      + primary_key                           = (sensitive value)
      + primary_master_key                    = (sensitive value)
      + primary_readonly_key                  = (sensitive value)
      + primary_readonly_master_key           = (sensitive value)
      + public_network_access_enabled         = true
      + read_endpoints                        = (known after apply)
      + resource_group_name                   = "pa-tsa-conference-app-api"
      + secondary_key                         = (sensitive value)
      + secondary_master_key                  = (sensitive value)
      + secondary_readonly_key                = (sensitive value)
      + secondary_readonly_master_key         = (sensitive value)
      + write_endpoints                       = (known after apply)

      + capabilities {
          + name = "EnableMongo"
        }

      + capacity {
          + total_throughput_limit = 1000
        }

      + consistency_policy {
          + consistency_level       = "BoundedStaleness"
          + max_interval_in_seconds = 400
          + max_staleness_prefix    = 200000
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "eastus"
          + zone_redundant    = false
        }
    }

  # azurerm_cosmosdb_mongo_collection.schedule_collection will be created
  + resource "azurerm_cosmosdb_mongo_collection" "schedule_collection" {
      + account_name        = "pa-tsa-conference-cosmos"
      + database_name       = "conference-app-cosmosdb"
      + id                  = (known after apply)
      + name                = "schedule"
      + resource_group_name = "pa-tsa-conference-app-api"
      + system_indexes      = (known after apply)
      + throughput          = (known after apply)
    }

  # azurerm_cosmosdb_mongo_database.conference_app_cosmosdb will be created
  + resource "azurerm_cosmosdb_mongo_database" "conference_app_cosmosdb" {
      + account_name        = "pa-tsa-conference-cosmos"
      + id                  = (known after apply)
      + name                = "conference-app-cosmosdb"
      + resource_group_name = "pa-tsa-conference-app-api"
      + throughput          = (known after apply)
    }

  # azurerm_resource_group.pa_tsa_conference_app_api_rg will be created
  + resource "azurerm_resource_group" "pa_tsa_conference_app_api_rg" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "pa-tsa-conference-app-api"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @tj-cappelletti, Action: `pull_request`*